app/views/questions/show.html.erb


<%= @question.answers.first.description %>
---
SELECT  "answers".* FROM "answers" WHERE "answers"."question_id" = $1 ORDER BY "answers"."id" ASC LIMIT $2  [["question_id", 3], ["LIMIT", 1]]