app/views/folders/show.html.erb

<h3>Start test</h3>
<% unless @folder.questions.empty? %>
---
SELECT  1 AS one FROM "questions" WHERE "questions"."folder_id" = $1 LIMIT $2  [["folder_id", 3], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."folder_id" = $1  [["folder_id", 3]]