app/controllers/folders_controller.rb

SELECT  "folders".* FROM "folders" WHERE "folders"."user_id" = $1 AND "folders"."loose" = $2 LIMIT $3  [["user_id", 5], ["loose", "false"], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" INNER JOIN "folders" ON "folders"."id" = "questions"."folder_id" WHERE "folders"."loose" = $1  [["loose", "true"]]
---
  def index
    @folders = Folder.where(user_id: current_user.id, loose: "false")
    @loose_folder = Folder.find_by(user_id: current_user.id, loose: "true")
    @loose_questions = Question.joins(:folder).where(folders: {loose: "true"})

INSERT INTO "folders" ("name", "user_id", "created_at", "updated_at", "loose") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "super"], ["user_id", 6], ["created_at", "2018-02-03 17:48:01.996506"], ["updated_at", "2018-02-03 17:48:01.996506"], ["loose", "false"]]
---
  def create
    @folder = Folder.new(folder_params)
    @folder.user = current_user
    if @folder.save!

UPDATE "folders" SET "name" = $1, "updated_at" = $2 WHERE "folders"."id" = $3  [["name", "History & philosophy"], ["updated_at", "2018-02-03 17:07:22.323413"], ["id", 1]]
---
  def update
    @folder.update(folder_params)

DELETE FROM "folders" WHERE "folders"."id" = $1  [["id", 1]]
---
  def destroy
    @folder.destroy

SELECT  "folders".* FROM "folders" WHERE "folders"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def set_folder
    @folder = Folder.find(params[:id])