app/controllers/questions_controller.rb

  def new
    @question = Question.new
    @folders = Folder.where(user_id: current_user.id, loose: "false")
---
SELECT "folders".* FROM "folders" WHERE "folders"."user_id" = $1 AND "folders"."loose" = $2  [["user_id", 6], ["loose", "false"]]

  def create
    @question = Question.new(question_params)
    @question.user_id = current_user.id
    if params[:question][:folder_id].empty?
      @folder = Folder.find_by(user_id: current_user.id, loose: "true")
    else
      @folder = Folder.find(params[:question][:folder_id])
    end
    @question.folder = @folder
    @answer = Answer.new(description: params[:question][:answer], source: params[:question][:source])
    @answer.question_id = @question.id
    @question.answer = @answer
    if @question.save!
---
SELECT  "folders".* FROM "folders" WHERE "folders"."user_id" = $1 AND "folders"."loose" = $2 LIMIT $3  [["user_id", 6], ["loose", "true"], ["LIMIT", 1]]
INSERT INTO "answers" ("description", "source", "created_at", "updated_at", "question_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "this is a test without a folder"], ["source", "none"], ["created_at", "2018-08-12 17:07:05.620783"], ["updated_at", "2018-08-12 17:07:05.620783"], ["question_id", 1]]
INSERT INTO "questions" ("description", "user_id", "folder_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "fasut"], ["user_id", 6], ["folder_id", 6], ["created_at", "2018-02-03 17:58:03.003366"], ["updated_at", "2018-02-03 17:58:03.003366"]]

  def edit
    @folders = Folder.where(user_id: current_user.id, loose: "false")
---
SELECT "folders".* FROM "folders" WHERE "folders"."user_id" = $1 AND "folders"."loose" = $2  [["user_id", 6], ["loose", "false"]]

  def update
    @question.update(question_params)
    answer = Answer.find_by(question_id: @question.id)
    answer.description = params[:question][:answer]
    answer.source = params[:question][:source]
    answer.save
---
UPDATE "questions" SET "folder_id" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["folder_id", 2], ["updated_at", "2018-08-12 17:33:44.174888"], ["id", 1]]
UPDATE "answers" SET "description" = $1, "source" = $2, "updated_at" = $3 WHERE "answers"."id" = $4  [["description", "trfed"], ["source", "des"], ["updated_at", "2018-08-12 17:34:18.992881"], ["id", 1]]

  def destroy
    @question.destroy
---
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 1]]