app/controllers/registrations_controller.rb

INSERT INTO "folders" ("name", "user_id", "created_at", "updated_at", "loose") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Loose Questions"], ["user_id", 5], ["created_at", "2018-02-03 17:44:48.401823"], ["updated_at", "2018-02-03 17:44:48.401823"], ["loose", "true"]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    super do
      Folder.create(name: "Loose Questions", user_id: resource.id, loose: "true")